import pandas as pd

#------------------------------------------------------------------
# DataFrameの生成
#------------------------------------------------------------------
# 簡潔なDataFrame生成
df=pd.DataFrame([['伊藤',52],['西村',48],['高木',44]])
# 行名・列名を指定してDataFrame生成
df=pd.DataFrame(
    data=[['伊藤',52],['西村',48],['高木',44]], 
    index=['e12137','e12135','e12169'], 
    columns=['name', 'age'])
# 行名・列名は後から設定・変更可能
df.columns=['名前','年齢']

#------------------------------------------------------------------
# DataFrameの行を抽出
#------------------------------------------------------------------
# 行番号(0～)で抽出 ---> [iloc]
print('----- 行を行番号で抽出 -----')
print('df.iloc[2] = \n{0}'.format(df.iloc[2])) # 行番号:2(3行目)を抽出
print('df.iloc[0:2] = \n{0}'.format(df.iloc[0:2])) # 範囲(0～1)を抽出
# 行名(index)で抽出 ---> [loc]
print('----- 行名(index)で抽出 ---> [loc] -----')
print('df.loc[\'e12137\'] = \n{0}'.format(df.loc['e12137']))
# 46歳以上を抽出
df_over46 = df[df['年齢']>=46]
# 名前が'西村'を抽出
df_西村 = df[df['名前']=='西村']
# 名前に'木'を含んでいる行を抽出
df_木 = df[df['名前'].str.contains('木')]

#------------------------------------------------------------------
# DataFrameの列を抽出
#------------------------------------------------------------------
# 列名で抽出
col_名前 = df['名前'] # 出力はDataFrameではなくSeries(1次元データ)
col_名前年齢 = df[['名前','年齢']]

#------------------------------------------------------------------
# DataFrameの要素にアクセス
#------------------------------------------------------------------
# 行名・列名でアクセス ---> [at]
print('----- 行名・列名でアクセス ---> [at] -----')
print('df.at[\'e12137\', \'名前\'] = {0}'.format(df.at['e12137', '名前']))
# 行番号・列番号でアクセス ---> [iat]
print('----- 行番号・列番号でアクセス ---> [iat] -----')
print('df.iat[1, 1] = {0}'.format(df.iat[1, 1]))

#------------------------------------------------------------------
# DataFrameのループ処理
#------------------------------------------------------------------
# 行のループ
print('----- 行のループ -----')
for idx, row in df.iterrows():
    print('行名:{0}, 要素:{1}'.format(idx, list(row)))
# 列のループ
print('----- 列のループ -----')
for col_name, col in df.iteritems():
    print('列名:{0}, 要素:{1}'.format(col_name, list(col)))

#------------------------------------------------------------------
# 行・列の削除
#------------------------------------------------------------------
df_dropped_row = df.drop(['e12135'])
df_dropped_col = df.drop(['名前'], axis=1)
